src/java-test/com/zimbra/common/soap/refNonExistentFileInEntity.xml

<?xml version="1.0" encoding="UTF-8"?><!DOCTYPE foo [
<!--
 * ***** BEGIN LICENSE BLOCK *****
 * 
 * Zimbra Collaboration Suite Server
 * Copyright (C) 2013 VMware, Inc.
 * 
 * The contents of this file are subject to the Zimbra Public License
 * Version 1.3 ("License"); you may not use this file except in
 * compliance with the License.  You may obtain a copy of the License at
 * http://www.zimbra.com/license.
 * 
 * Software distributed under the License is distributed on an "AS IS"
 * basis, WITHOUT WARRANTY OF ANY KIND, either express or implied.
 * 
 * ***** END LICENSE BLOCK *****
-->
<!ENTITY readNonExist SYSTEM "file:///tmp/not/there/non-existent.xml" >]>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
<soap:Header>
<context xmlns="urn:zimbra">
  <authToken>deleted</authToken>
<nosession></nosession>
</context>
</soap:Header>
<soap:Body>
<GetFolderRequest xmlns="urn:zimbraMail">
    <folder><path>Fun[&readNonExist;]Here</path></folder>
</GetFolderRequest>
</soap:Body>
</soap:Envelope>
